# Análise Exploratória dos arquivos - EMPRESA DISCORAMA

### Importações

In [137]:
# Importando bibliotecas
import pandas as pd

#### Análise exploratória - Actor

In [138]:
#Leitura do arquivo 
actor = pd.read_csv("actor.csv")

In [139]:
# Total de linhas e colunas
total_linhas_colunas = actor.shape
print("Esse é o total de linhas e colunas:")
print(total_linhas_colunas)

Esse é o total de linhas e colunas:
(200, 4)

In [140]:
# Verificando se existem linhas duplicadas
linhas_duplicadas = actor[actor.duplicated()]
print("Linhas duplicadas:")
print(linhas_duplicadas)

Linhas duplicadas:
Empty DataFrame
Columns: [actor_id, first_name, last_name, last_update]
Index: []

In [141]:
# Verificar a quantidade de valores nulos (NaN) ou em branco em cada coluna
valores_nulos  = actor.isnull().sum()
print("Quantidade de valores nulos (NaN) ou em branco em cada coluna:")
print(valores_nulos )

Quantidade de valores nulos (NaN) ou em branco em cada coluna:
actor_id       0
first_name     0
last_name      0
last_update    0
dtype: int64

In [142]:
#Visualizando as 5 primeiras linhas
actor.head()

   actor_id first_name     last_name              last_update
0         1   Penelope       Guiness  2013-05-26 14:47:57.620
1         2       Nick      Wahlberg  2013-05-26 14:47:57.620
2         3         Ed         Chase  2013-05-26 14:47:57.620
3         4   Jennifer         Davis  2013-05-26 14:47:57.620
4         5     Johnny  Lollobrigida  2013-05-26 14:47:57.620

In [143]:
#Ultimas linhas do conjunto de dados
actor.tail()

     actor_id first_name last_name              last_update
195       196       Bela    Walken  2013-05-26 14:47:57.620
196       197      Reese      West  2013-05-26 14:47:57.620
197       198       Mary    Keitel  2013-05-26 14:47:57.620
198       199      Julia   Fawcett  2013-05-26 14:47:57.620
199       200      Thora    Temple  2013-05-26 14:47:57.620

In [144]:
#Tipo de dados de cada coluna
print(actor.dtypes)

actor_id        int64
first_name     object
last_name      object
last_update    object
dtype: object

In [145]:
# Alteração da coluna last_update para DateTime
actor['last_update'] = pd.to_datetime(actor['last_update'])

In [146]:
#Visualização do tipo das colunas, após a alteração
print(actor.dtypes)

actor_id                int64
first_name             object
last_name              object
last_update    datetime64[ns]
dtype: object

In [147]:
# Visualização das 5 primeiras linhas, após alteração
actor.head()

   actor_id first_name     last_name             last_update
0         1   Penelope       Guiness 2013-05-26 14:47:57.620
1         2       Nick      Wahlberg 2013-05-26 14:47:57.620
2         3         Ed         Chase 2013-05-26 14:47:57.620
3         4   Jennifer         Davis 2013-05-26 14:47:57.620
4         5     Johnny  Lollobrigida 2013-05-26 14:47:57.620

#### Análise exploratória - Address

In [148]:
#Leitura do arquivo 
address = pd.read_csv("address.csv")

In [149]:
# Total de linhas e colunas
total_linhas_colunas = address.shape
print("Esse é o total de linhas e colunas:")
print(total_linhas_colunas)

Esse é o total de linhas e colunas:
(603, 8)

In [150]:
# Visualizando as 5 primeiras linhas
address.head()

,address_id,address,address2,district,city_id,postal_code,phone,last_update
0,1,47 MySakila Drive,NaN,Alberta,300,NaN,NaN,2006-02-15 09:45:30.000
1,2,28 MySQL Boulevard,NaN,QLD,576,NaN,NaN,2006-02-15 09:45:30.000
2,3,23 Workhaven Lane,NaN,Alberta,300,NaN,1.403334e+10,2006-02-15 09:45:30.000
3,4,1411 Lillydale Drive,NaN,QLD,576,NaN,6.172236e+09,2006-02-15 09:45:30.000
4,5,1913 Hanoi Way,NaN,Nagasaki,463,35200.0,2.830338e+10,2006-02-15 09:45:30.000

In [151]:
#Ultimas linhas do conjunto de dados
address.tail()

,address_id,address,address2,district,city_id,postal_code,phone,last_update
598,601,844 Bucuresti Place,NaN,Liaoning,242,36603.0,9.359524e+11,2006-02-15 09:45:30.000
599,602,1101 Bucuresti Boulevard,NaN,West Greece,401,97661.0,1.995146e+11,2006-02-15 09:45:30.000
600,603,1103 Quilmes Boulevard,NaN,Piura,503,52137.0,6.440214e+11,2006-02-15 09:45:30.000
601,604,1331 Usak Boulevard,NaN,Vaud,296,61960.0,1.453087e+11,2006-02-15 09:45:30.000
602,605,1325 Fukuyama Street,NaN,Heilongjiang,537,27107.0,2.882412e+11,2006-02-15 09:45:30.000

In [152]:
# Verificando se existem linhas duplicadas
linhas_duplicadas = address[address.duplicated()]
print("Linhas duplicadas:")
print(linhas_duplicadas)

Linhas duplicadas:
Empty DataFrame
Columns: [address_id, address, address2, district, city_id, postal_code, phone, last_update]
Index: []

In [153]:
# Verificar a quantidade de valores nulos (NaN) ou em branco em cada coluna
valores_nulos  = address.isnull().sum()
print("Quantidade de valores nulos (NaN) ou em branco em cada coluna:")
print(valores_nulos )

Quantidade de valores nulos (NaN) ou em branco em cada coluna:
address_id       0
address          0
address2       603
district         3
city_id          0
postal_code      4
phone            2
last_update      0
dtype: int64

In [154]:
# Excluindo a coluna address2 (vazia)
address = pd.DataFrame(address)
address = address.drop("address2", axis=1)

In [155]:
# Tratamento coluna district
address['district'] = address['district'].fillna(' - ') # Preenchendo os espaços vazios

# Tratamento coluna postal_code
address['postal_code'] = address['postal_code'].fillna('000') # Preenchendo os espaços vazios
address['postal_code'] = address['postal_code'].astype(int) # Alterando de float64 para int

# Alterando coluna phone: Preenchendo espaços vazios e alterando de float para str
address['phone'] = address['phone'].fillna('000').astype(str)

In [156]:
# Visualizando valores nulos (NaN) ou em branco após alterações
valores_nulos = address.isnull().sum()
print("Quantidade de valores nulos (NaN) ou em branco em cada coluna:")
print(valores_nulos)

Quantidade de valores nulos (NaN) ou em branco em cada coluna:
address_id     0
address        0
district       0
city_id        0
postal_code    0
phone          0
last_update    0
dtype: int64

In [157]:
# Visualizando o tipo das colunas
print(address.dtypes)

address_id      int64
address        object
district       object
city_id         int64
postal_code     int32
phone          object
last_update    object
dtype: object

In [158]:
# Alteração da coluna last_update para DateTime
address['last_update'] = pd.to_datetime(address['last_update'])

In [159]:
# Visualizando o tipo das colunas após alteração acima
print(address.dtypes)

address_id              int64
address                object
district               object
city_id                 int64
postal_code             int32
phone                  object
last_update    datetime64[ns]
dtype: object

In [160]:
# Visualizando as 5 primeiras linhas após alterações
address.head()

,address_id,address,district,city_id,postal_code,phone,last_update
0,1,47 MySakila Drive,Alberta,300,0,000,2006-02-15 09:45:30
1,2,28 MySQL Boulevard,QLD,576,0,000,2006-02-15 09:45:30
2,3,23 Workhaven Lane,Alberta,300,0,14033335568.0,2006-02-15 09:45:30
3,4,1411 Lillydale Drive,QLD,576,0,6172235589.0,2006-02-15 09:45:30
4,5,1913 Hanoi Way,Nagasaki,463,35200,28303384290.0,2006-02-15 09:45:30

#### Análise exploratória - Category

In [161]:
#Leitura do arquivo 
category = pd.read_csv("category.csv")

In [162]:
# Total de linhas e colunas
total_linhas_colunas = category.shape
print("Esse é o total de linhas e colunas:")
print(total_linhas_colunas)

Esse é o total de linhas e colunas:
(16, 3)

In [163]:
# Verificando se existem linhas duplicadas
linhas_duplicadas = category[category.duplicated()]
print("Linhas duplicadas:")
print(linhas_duplicadas)

Linhas duplicadas:
Empty DataFrame
Columns: [category_id, name, last_update]
Index: []

In [164]:
# Verificando se há valores nulos (NaN) ou em branco em cada coluna
valores_nulos = category.isnull().sum()
print("Quantidade de valores nulos (NaN) ou em branco em cada coluna:")
print(valores_nulos)

Quantidade de valores nulos (NaN) ou em branco em cada coluna:
category_id    0
name           0
last_update    0
dtype: int64

In [165]:
# Visualizando o tipo das colunas
print(category.dtypes)

category_id     int64
name           object
last_update    object
dtype: object

In [166]:
# Alteração da coluna last_update para DateTime
category['last_update'] = pd.to_datetime(category['last_update'])

In [167]:
# Visualizando o tipo das colunas após alteração
print(category.dtypes)

category_id             int64
name                   object
last_update    datetime64[ns]
dtype: object

In [168]:
#Visualizando as 5 primeiras linhas após alteração
category.head()

   category_id       name         last_update
0            1     Action 2006-02-15 09:46:27
1            2  Animation 2006-02-15 09:46:27
2            3   Children 2006-02-15 09:46:27
3            4   Classics 2006-02-15 09:46:27
4            5     Comedy 2006-02-15 09:46:27

#### Análise exploratória - CITY

In [169]:
#Leitura do arquivo 
city = pd.read_csv("city.csv")

In [170]:
# Total de linhas e colunas
total_linhas_colunas = city.shape
print("Esse é o total de linhas e colunas:")
print(total_linhas_colunas)

Esse é o total de linhas e colunas:
(600, 4)

In [171]:
# Verificando se existem linhas duplicadas
linhas_duplicadas = city[city.duplicated()]
print("Linhas duplicadas:")
print(linhas_duplicadas)

Linhas duplicadas:
Empty DataFrame
Columns: [city_id, city, country_id, last_update]
Index: []

In [172]:
# Verificando se há valores nulos (NaN) ou em branco em cada coluna
valores_nulos = city.isnull().sum()
print("Quantidade de valores nulos (NaN) ou em branco em cada coluna:")
print(valores_nulos)

Quantidade de valores nulos (NaN) ou em branco em cada coluna:
city_id        0
city           0
country_id     0
last_update    0
dtype: int64

In [173]:
#Visualizando as 5 primeiras linhas
city.head()

   city_id                city  country_id              last_update
0        1  A Corua (La Corua)          87  2006-02-15 09:45:25.000
1        2                Abha          82  2006-02-15 09:45:25.000
2        3           Abu Dhabi         101  2006-02-15 09:45:25.000
3        4                Acua          60  2006-02-15 09:45:25.000
4        5               Adana          97  2006-02-15 09:45:25.000

In [174]:
#Visualizando o tipo das colunas
print(city.dtypes)

city_id         int64
city           object
country_id      int64
last_update    object
dtype: object

In [175]:
# Alteração da coluna last_update:
city['last_update'] = pd.to_datetime(city['last_update']) #Alterando para DateTime

In [176]:
#Visualizando tipo das colunas, após a mudança
print(city.dtypes)

city_id                 int64
city                   object
country_id              int64
last_update    datetime64[ns]
dtype: object

In [177]:
#Visualizando as 5 primeiras linhas, após a mudança
city.head()

   city_id                city  country_id         last_update
0        1  A Corua (La Corua)          87 2006-02-15 09:45:25
1        2                Abha          82 2006-02-15 09:45:25
2        3           Abu Dhabi         101 2006-02-15 09:45:25
3        4                Acua          60 2006-02-15 09:45:25
4        5               Adana          97 2006-02-15 09:45:25

#### Análise exploratória - COUNTRY

In [178]:
#Leitura do arquivo 
country = pd.read_csv("country.csv")

In [179]:
# Total de linhas e colunas
total_linhas_colunas = country.shape
print("Esse é o total de linhas e colunas:")
print(total_linhas_colunas)

Esse é o total de linhas e colunas:
(109, 3)

In [180]:
# Verificando se existem linhas duplicadas
linhas_duplicadas = country[country.duplicated()]
print("Linhas duplicadas:")
print(linhas_duplicadas)

Linhas duplicadas:
Empty DataFrame
Columns: [country_id, country, last_update]
Index: []

In [181]:
# Verificando se há valores nulos (NaN) ou em branco em cada coluna
valores_nulos = country.isnull().sum()
print("Quantidade de valores nulos (NaN) ou em branco em cada coluna:")
print(valores_nulos)

Quantidade de valores nulos (NaN) ou em branco em cada coluna:
country_id     0
country        0
last_update    0
dtype: int64

In [182]:
# Visulizando as 5 primeiras linhas
country.head()

   country_id         country              last_update
0           1     Afghanistan  2006-02-15 09:44:00.000
1           2         Algeria  2006-02-15 09:44:00.000
2           3  American Samoa  2006-02-15 09:44:00.000
3           4          Angola  2006-02-15 09:44:00.000
4           5        Anguilla  2006-02-15 09:44:00.000

In [183]:
# Visualizando o tipo das colunas
print(country.dtypes)

country_id      int64
country        object
last_update    object
dtype: object

In [184]:
# Alteração da coluna last_update:
country['last_update'] = pd.to_datetime(country['last_update']) #Alterando para DateTime

In [185]:
# Visualizando o tipo das colunas, após a alteração
print(country.dtypes)

country_id              int64
country                object
last_update    datetime64[ns]
dtype: object

#### Análise exploratória - CUSTOMER

In [186]:
#Leitura do arquivo 
customer = pd.read_csv("customer.csv")

In [187]:
# Total de linhas e colunas
total_linhas_colunas = customer.shape
print("Esse é o total de linhas e colunas:")
print(total_linhas_colunas)

Esse é o total de linhas e colunas:
(599, 10)

In [188]:
# Verificando se existem linhas duplicadas
linhas_duplicadas = customer[customer.duplicated()]
print("Linhas duplicadas:")
print(linhas_duplicadas)

Linhas duplicadas:
Empty DataFrame
Columns: [customer_id, store_id, first_name, last_name, email, address_id, activebool, create_date, last_update, active]
Index: []

In [189]:
# Verificando se há valores nulos (NaN) ou em branco em cada coluna
valores_nulos = customer.isnull().sum()
print("Quantidade de valores nulos (NaN) ou em branco em cada coluna:")
print(valores_nulos)

Quantidade de valores nulos (NaN) ou em branco em cada coluna:
customer_id    0
store_id       0
first_name     0
last_name      0
email          0
address_id     0
activebool     0
create_date    0
last_update    0
active         0
dtype: int64

In [190]:
# Visualizando as 5 primeiras linhas 
customer.head()

,customer_id,store_id,first_name,last_name,email,address_id,activebool,create_date,last_update,active
0,524,1,Jared,Ely,jared.ely@sakilacustomer.org,530,True,2006-02-14,2013-05-26 14:49:45.738,1
1,1,1,Mary,Smith,mary.smith@sakilacustomer.org,5,True,2006-02-14,2013-05-26 14:49:45.738,1
2,2,1,Patricia,Johnson,patricia.johnson@sakilacustomer.org,6,True,2006-02-14,2013-05-26 14:49:45.738,1
3,3,1,Linda,Williams,linda.williams@sakilacustomer.org,7,True,2006-02-14,2013-05-26 14:49:45.738,1
4,4,2,Barbara,Jones,barbara.jones@sakilacustomer.org,8,True,2006-02-14,2013-05-26 14:49:45.738,1

In [191]:
# Visualizando o tipo das colunas
print(customer.dtypes)

customer_id     int64
store_id        int64
first_name     object
last_name      object
email          object
address_id      int64
activebool       bool
create_date    object
last_update    object
active          int64
dtype: object

In [192]:
# Alteração da coluna last_update:
customer['last_update'] = pd.to_datetime(customer['last_update']) #Alterando para DateTime

In [193]:
# Visualizando o tipo das colunas, após a alterção
print(customer.dtypes)

customer_id             int64
store_id                int64
first_name             object
last_name              object
email                  object
address_id              int64
activebool               bool
create_date            object
last_update    datetime64[ns]
active                  int64
dtype: object

#### Análise exploratória - FILM

In [194]:
#Leitura do arquivo 
film = pd.read_csv("film.csv")

In [195]:
# Total de linhas e colunas
total_linhas_colunas = film.shape
print("Esse é o total de linhas e colunas:")
print(total_linhas_colunas)

Esse é o total de linhas e colunas:
(1000, 13)

In [196]:
# Verificando se existem linhas duplicadas
linhas_duplicadas = film[film.duplicated()]
print("Linhas duplicadas:")
print(linhas_duplicadas)

Linhas duplicadas:
Empty DataFrame
Columns: [film_id, title, description, release_year, language_id, rental_duration, rental_rate, length, replacement_cost, rating, last_update, special_features, fulltext]
Index: []

In [197]:
# Verificando se há valores nulos (NaN) ou em branco em cada coluna
valores_nulos = film.isnull().sum()
print("Quantidade de valores nulos (NaN) ou em branco em cada coluna:")
print(valores_nulos)

Quantidade de valores nulos (NaN) ou em branco em cada coluna:
film_id             0
title               0
description         0
release_year        0
language_id         0
rental_duration     0
rental_rate         0
length              0
replacement_cost    0
rating              0
last_update         0
special_features    0
fulltext            0
dtype: int64

In [198]:
film.head()

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,last_update,special_features,fulltext
0,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,2013-05-26 14:50:58.951,{Trailers},'chamber':1 'fate':4 'husband':11 'italian':2 ...
1,384,Grosse Wonderful,A Epic Drama of a Cat And a Explorer who must ...,2006,1,5,4.99,49,19.99,R,2013-05-26 14:50:58.951,"{""Behind the Scenes""}",'australia':18 'cat':8 'drama':5 'epic':4 'exp...
2,8,Airport Pollock,A Epic Tale of a Moose And a Girl who must Con...,2006,1,6,4.99,54,15.99,R,2013-05-26 14:50:58.951,{Trailers},'airport':1 'ancient':18 'confront':14 'epic':...
3,98,Bright Encounters,A Fateful Yarn of a Lumberjack And a Feminist ...,2006,1,4,4.99,73,12.99,PG-13,2013-05-26 14:50:58.951,{Trailers},'boat':20 'bright':1 'conquer':14 'encount':2 ...
4,1,Academy Dinosaur,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,2013-05-26 14:50:58.951,"{""Deleted Scenes"",""Behind the Scenes""}",'academi':1 'battl':15 'canadian':20 'dinosaur...

In [199]:
# Visualizando o tipo das colunas
print(film.dtypes)

film_id               int64
title                object
description          object
release_year          int64
language_id           int64
rental_duration       int64
rental_rate         float64
length                int64
replacement_cost    float64
rating               object
last_update          object
special_features     object
fulltext             object
dtype: object

In [200]:
# Alteração da coluna last_update:
film['last_update'] = pd.to_datetime(film['last_update']) #Alterando para DateTime

In [201]:
# Visualizando o tipo das colunas, após alterações
print(film.dtypes)

film_id                      int64
title                       object
description                 object
release_year                 int64
language_id                  int64
rental_duration              int64
rental_rate                float64
length                       int64
replacement_cost           float64
rating                      object
last_update         datetime64[ns]
special_features            object
fulltext                    object
dtype: object

#### Análise exploratória - FILM_ACTOR

In [202]:
#Leitura do arquivo 
film_actor = pd.read_csv("film_actor.csv")

In [203]:
# Total de linhas e colunas
total_linhas_colunas = film_actor.shape
print("Esse é o total de linhas e colunas:")
print(total_linhas_colunas)

Esse é o total de linhas e colunas:
(5462, 3)

In [204]:
# Verificando se existem linhas duplicadas
linhas_duplicadas = film_actor[film_actor.duplicated()]
print("Linhas duplicadas:")
print(linhas_duplicadas)

Linhas duplicadas:
Empty DataFrame
Columns: [actor_id, film_id, last_update]
Index: []

In [205]:
# Verificando se há valores nulos (NaN) ou em branco em cada coluna
valores_nulos = film_actor.isnull().sum()
print("Quantidade de valores nulos (NaN) ou em branco em cada coluna:")
print(valores_nulos)

Quantidade de valores nulos (NaN) ou em branco em cada coluna:
actor_id       0
film_id        0
last_update    0
dtype: int64

In [206]:
# Verificando se há COLUNAS em branco
col_branco = film_actor.isna().any()

print(col_branco)

actor_id       False
film_id        False
last_update    False
dtype: bool

In [207]:
# Visualizando as 5 primeiras linhas 
film_actor.head()

   actor_id  film_id              last_update
0         1        1  2006-02-15 10:05:03.000
1         1       23  2006-02-15 10:05:03.000
2         1       25  2006-02-15 10:05:03.000
3         1      106  2006-02-15 10:05:03.000
4         1      140  2006-02-15 10:05:03.000

In [208]:
# Visualizando o tipo das colunas, após alterações
print(film_actor.dtypes)

actor_id        int64
film_id         int64
last_update    object
dtype: object

In [209]:
# Alteração da coluna last_update:
film_actor['last_update'] = pd.to_datetime(film_actor['last_update']) #Alterando para DateTime

In [210]:
# Visualizando as 5 primeiras linhas, após alterações
film_actor.head()

   actor_id  film_id         last_update
0         1        1 2006-02-15 10:05:03
1         1       23 2006-02-15 10:05:03
2         1       25 2006-02-15 10:05:03
3         1      106 2006-02-15 10:05:03
4         1      140 2006-02-15 10:05:03

In [211]:
# Visualizando o tipo das colunas, após alterações
print(film_actor.dtypes)

actor_id                int64
film_id                 int64
last_update    datetime64[ns]
dtype: object

#### Análise exploratória - FILM_CATEGORY

In [212]:
#Leitura do arquivo 
film_category = pd.read_csv("film_category.csv")

In [213]:
# Total de linhas e colunas
total_linhas_colunas = film_category.shape
print("Esse é o total de linhas e colunas:")
print(total_linhas_colunas)

Esse é o total de linhas e colunas:
(1000, 3)

In [214]:
# Verificando se existem linhas duplicadas
linhas_duplicadas = film_category[film_category.duplicated()]
print("Linhas duplicadas:")
print(linhas_duplicadas)

Linhas duplicadas:
Empty DataFrame
Columns: [film_id, category_id, last_update]
Index: []

In [215]:
# Verificando se há valores nulos (NaN) ou em branco em cada coluna
valores_nulos  = film_category.isnull().sum()
print("Quantidade de valores nulos (NaN) ou em branco em cada coluna:")
print(valores_nulos )

Quantidade de valores nulos (NaN) ou em branco em cada coluna:
film_id        0
category_id    0
last_update    0
dtype: int64

In [216]:
# Visualizando as 5 primeiras linhas
film_category.head()

   film_id  category_id              last_update
0        1            6  2006-02-15 10:07:09.000
1        2           11  2006-02-15 10:07:09.000
2        3            6  2006-02-15 10:07:09.000
3        4           11  2006-02-15 10:07:09.000
4        5            8  2006-02-15 10:07:09.000

In [217]:
# Visualizando o tipo das colunas
print(film_category.dtypes)

film_id         int64
category_id     int64
last_update    object
dtype: object

In [218]:
# Alteração da coluna last_update:
film_category['last_update'] = pd.to_datetime(film_category['last_update']) #Alterando para DateTime

In [219]:
# Visualizando o tipo das colunas, após alterações
print(film_category.dtypes)

film_id                 int64
category_id             int64
last_update    datetime64[ns]
dtype: object

#### Análise exploratória - INVENTORY

In [220]:
#Leitura do arquivo 
inventory = pd.read_csv("inventory.csv")

In [221]:
# Total de linhas e colunas
total_linhas_colunas = inventory.shape
print("Esse é o total de linhas e colunas:")
print(total_linhas_colunas)

Esse é o total de linhas e colunas:
(4581, 4)

In [222]:
# Verificando se existem linhas duplicadas
linhas_duplicadas = inventory[inventory.duplicated()]
print("Linhas duplicadas:")
print(linhas_duplicadas)

Linhas duplicadas:
Empty DataFrame
Columns: [inventory_id, film_id, store_id, last_update]
Index: []

In [223]:
# Verificando se há valores nulos (NaN) ou em branco em cada coluna
null_counts = inventory.isnull().sum()
print("Quantidade de valores nulos (NaN) ou em branco em cada coluna:")
print(null_counts)

Quantidade de valores nulos (NaN) ou em branco em cada coluna:
inventory_id    0
film_id         0
store_id        0
last_update     0
dtype: int64

In [224]:
# Visualizando as 5 primeiras linhas
inventory.head()

   inventory_id  film_id  store_id              last_update
0             1        1         1  2006-02-15 10:09:17.000
1             2        1         1  2006-02-15 10:09:17.000
2             3        1         1  2006-02-15 10:09:17.000
3             4        1         1  2006-02-15 10:09:17.000
4             5        1         2  2006-02-15 10:09:17.000

In [225]:
# Visualizando o tipo das colunas
print(inventory.dtypes)

inventory_id     int64
film_id          int64
store_id         int64
last_update     object
dtype: object

In [226]:
# Alteração da coluna last_update:
inventory['last_update'] = pd.to_datetime(inventory['last_update']) #Alterando para DateTime

In [227]:
# Visualizando o tipo das colunas, após alterações
print(inventory.dtypes)

inventory_id             int64
film_id                  int64
store_id                 int64
last_update     datetime64[ns]
dtype: object

#### Análise exploratória - PAYMENT

In [228]:
#Leitura do arquivo 
payment = pd.read_csv("payment.csv")

In [229]:
# Total de linhas e colunas
total_linhas_colunas = payment.shape
print("Esse é o total de linhas e colunas:")
print(total_linhas_colunas)

Esse é o total de linhas e colunas:
(14596, 6)

In [230]:
# Verificando se existem linhas duplicadas
linhas_duplicadas = payment[payment.duplicated()]
print("Linhas duplicadas:")
print(linhas_duplicadas)

Linhas duplicadas:
Empty DataFrame
Columns: [payment_id, customer_id, staff_id, rental_id, amount, payment_date]
Index: []

In [231]:
# Verificando se há valores nulos (NaN) ou em branco em cada coluna
valores_nulos  = payment.isnull().sum()
print("Quantidade de valores nulos (NaN) ou em branco em cada coluna:")
print(valores_nulos )

Quantidade de valores nulos (NaN) ou em branco em cada coluna:
payment_id      0
customer_id     0
staff_id        0
rental_id       0
amount          0
payment_date    0
dtype: int64

In [232]:
#Visualização das 5 primeiras linhas
payment.head()

,payment_id,customer_id,staff_id,rental_id,amount,payment_date
0,17503,341,2,1520,7.99,2007-02-15 22:25:46.996
1,17504,341,1,1778,1.99,2007-02-16 17:23:14.996
2,17505,341,1,1849,7.99,2007-02-16 22:41:45.996
3,17506,341,2,2829,2.99,2007-02-19 19:39:56.996
4,17507,341,2,3130,7.99,2007-02-20 17:31:48.996

In [233]:
# Exibindo o valor médio de pagamento
payment["amount"].mean()

4.200605645382297

In [234]:
#Retornando o maior aluguel
payment["amount"].max()

11.99

In [235]:
#Retornando o menor aluguel
payment["amount"].min()

0.0

In [236]:
# Exibindo os 3 maiores alugueis
payment.nlargest(3,"amount")

,payment_id,customer_id,staff_id,rental_id,amount,payment_date
2900,20403,362,1,14759,11.99,2007-03-21 21:57:24.996
5147,22650,204,2,15415,11.99,2007-03-22 22:17:22.996
6254,23757,116,2,14763,11.99,2007-03-21 22:02:26.996

In [237]:
#Exibindo os 3 menos aluguies
payment.nsmallest(3, "amount")

,payment_id,customer_id,staff_id,rental_id,amount,payment_date
14415,31918,267,2,13713,0.0,2007-05-14 13:44:29.996
14417,31920,269,2,12610,0.0,2007-05-14 13:44:29.996
14422,31925,284,2,12959,0.0,2007-05-14 13:44:29.996

In [238]:
# Visualizando o tipo das colunas
print(payment.dtypes)

payment_id        int64
customer_id       int64
staff_id          int64
rental_id         int64
amount          float64
payment_date     object
dtype: object

In [239]:
# Alteração da coluna payment_date:
payment['payment_date'] = pd.to_datetime(payment['payment_date']) #Alterando para DateTime

In [240]:
# Visualizando o tipo das colunas, após alterações
print(payment.dtypes)

payment_id               int64
customer_id              int64
staff_id                 int64
rental_id                int64
amount                 float64
payment_date    datetime64[ns]
dtype: object

#### Análise exploratória- RENTAL

In [241]:
rental = pd.read_csv("rental.csv")

In [242]:
# Total de linhas e colunas
total_linhas_colunas = rental.shape
print("Esse é o total de linhas e colunas:")
print(total_linhas_colunas)

Esse é o total de linhas e colunas:
(11086, 7)

In [243]:
# Verificando se existem linhas duplicadas
linhas_duplicadas = rental[rental.duplicated()]
print("Linhas duplicadas:")
print(linhas_duplicadas)

Linhas duplicadas:
Empty DataFrame
Columns: [rental_id, rental_date, inventory_id, customer_id, return_date, staff_id, last_update]
Index: []

In [244]:
# Verificando se há valores nulos (NaN) ou em branco em cada coluna
valores_nulos  = rental.isnull().sum()
print("Quantidade de valores nulos (NaN) ou em branco em cada coluna:")
print(valores_nulos )

Quantidade de valores nulos (NaN) ou em branco em cada coluna:
rental_id       0
rental_date     0
inventory_id    0
customer_id     0
return_date     0
staff_id        0
last_update     1
dtype: int64

Nota: apesar de conter uma informação nula, vou deixar assim para que possa analisar e tratar no próximo passo.

In [245]:
# Verificando se há valores nulos (NaN) ou em branco, após a alteração
valores_nulos  = rental.isnull().sum()
print("Quantidade de valores nulos (NaN) ou em branco em cada coluna:")
print(valores_nulos )

Quantidade de valores nulos (NaN) ou em branco em cada coluna:
rental_id       0
rental_date     0
inventory_id    0
customer_id     0
return_date     0
staff_id        0
last_update     1
dtype: int64

In [246]:
# Visualizando as 5 primeiras linhas
rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,2,2005-05-24 22:54:33.000,1525,459,2005-05-28 19:40:33.000,1,2006-02-16 02:30:53.000
1,3,2005-05-24 23:03:39.000,1711,408,2005-06-01 22:12:39.000,1,2006-02-16 02:30:53.000
2,4,2005-05-24 23:04:41.000,2452,333,2005-06-03 01:43:41.000,2,2006-02-16 02:30:53.000
3,5,2005-05-24 23:05:21.000,2079,222,2005-06-02 04:33:21.000,1,2006-02-16 02:30:53.000
4,6,2005-05-24 23:08:07.000,2792,549,2005-05-27 01:32:07.000,1,2006-02-16 02:30:53.000

In [247]:
# Visualizando o tipo das colunas
print(rental.dtypes)

rental_id        int64
rental_date     object
inventory_id     int64
customer_id      int64
return_date     object
staff_id         int64
last_update     object
dtype: object

In [248]:
# Alteração das colunas para DateTime:
rental['rental_date'] = pd.to_datetime(rental['rental_date'])
rental['return_date'] = pd.to_datetime(rental['return_date'])
rental['last_update'] = pd.to_datetime(rental['last_update'])

In [249]:
# Visualizando o tipo das colunas, após alterações
print(rental.dtypes)

rental_id                int64
rental_date     datetime64[ns]
inventory_id             int64
customer_id              int64
return_date     datetime64[ns]
staff_id                 int64
last_update     datetime64[ns]
dtype: object

#### Análise exploratória  - STAFF

In [250]:
#Leitura do arquivo 
staff = pd.read_csv("staff.csv")

In [251]:
# Total de linhas e colunas
total_linhas_colunas = staff.shape
print("Esse é o total de linhas e colunas:")
print(total_linhas_colunas)

Esse é o total de linhas e colunas:
(3, 11)

In [252]:
# Verificando se existem linhas duplicadas
linhas_duplicadas = staff[staff.duplicated()]
print("Linhas duplicadas:")
print(linhas_duplicadas)

Linhas duplicadas:
Empty DataFrame
Columns: [staff_id, first_name, last_name, address_id, email, store_id, active, username, password, last_update, picture]
Index: []

In [253]:
# Verificando se há valores nulos (NaN) ou em branco em cada coluna
valores_nulos = staff.isnull().sum()
print("Quantidade de valores nulos (NaN) ou em branco em cada coluna:")
print(valores_nulos)

Quantidade de valores nulos (NaN) ou em branco em cada coluna:
staff_id       0
first_name     1
last_name      1
address_id     1
email          1
store_id       1
active         1
username       1
password       1
last_update    1
picture        2
dtype: int64

In [254]:
# Visualizando o tipo das colunas
staff.head()

,staff_id,first_name,last_name,address_id,email,store_id,active,username,password,last_update,picture
0,1,Mike,Hillyer,3.0,Mike.Hillyer@sakilastaff.com,1.0,True,Mike,8cb2237d0679ca88db6464eac60da96345513964,2006-05-16 16:13:11.793,�PNG
1,Z,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2,Jon,Stephens,4.0,Jon.Stephens@sakilastaff.com,2.0,True,Jon,8cb2237d0679ca88db6464eac60da96345513964,2006-05-16 16:13:11.793,NaN

In [255]:
# Excluindo linhas vazias
staff = pd.DataFrame(staff)
staff = staff.dropna(subset=['first_name'])

In [256]:
# Visualizando o tipo das colunas, após alterações
staff.head()

,staff_id,first_name,last_name,address_id,email,store_id,active,username,password,last_update,picture
0,1,Mike,Hillyer,3.0,Mike.Hillyer@sakilastaff.com,1.0,True,Mike,8cb2237d0679ca88db6464eac60da96345513964,2006-05-16 16:13:11.793,�PNG
2,2,Jon,Stephens,4.0,Jon.Stephens@sakilastaff.com,2.0,True,Jon,8cb2237d0679ca88db6464eac60da96345513964,2006-05-16 16:13:11.793,NaN

In [257]:
# Atribuindo um novo DataFrame sem a coluna "picture" pois a mesma está com dados comprometidos e não prejudica a análise
staff = staff.drop(columns='picture')

In [258]:
# Visualizando o tipo das colunas, após exclusão
staff.head()

,staff_id,first_name,last_name,address_id,email,store_id,active,username,password,last_update
0,1,Mike,Hillyer,3.0,Mike.Hillyer@sakilastaff.com,1.0,True,Mike,8cb2237d0679ca88db6464eac60da96345513964,2006-05-16 16:13:11.793
2,2,Jon,Stephens,4.0,Jon.Stephens@sakilastaff.com,2.0,True,Jon,8cb2237d0679ca88db6464eac60da96345513964,2006-05-16 16:13:11.793

In [259]:
# Visualizando tipo dos dados 
print(staff.dtypes)

staff_id        object
first_name      object
last_name       object
address_id     float64
email           object
store_id       float64
active          object
username        object
password        object
last_update     object
dtype: object

In [260]:
# Alterações do tipo das colunas
staff['last_update'] = pd.to_datetime(staff['last_update']) #Alteração da coluna para DateTime
staff['address_id'] = staff['address_id'].astype('int64') #Alteração da coluna para int64

In [261]:
#Visualizando tipo dos dados, após as alterações
print(staff.dtypes)

staff_id               object
first_name             object
last_name              object
address_id              int64
email                  object
store_id              float64
active                 object
username               object
password               object
last_update    datetime64[ns]
dtype: object

#### Análise exploratória  - STORE

In [262]:
#Leitura do arquivo 
store = pd.read_csv("store.csv")

In [263]:
# Total de linhas e colunas
total_linhas_colunas = store.shape
print("Esse é o total de linhas e colunas:")
print(total_linhas_colunas)

Esse é o total de linhas e colunas:
(2, 4)

In [264]:
# Verificando se existem linhas duplicadas
linhas_duplicadas = store[store.duplicated()]
print("Linhas duplicadas:")
print(linhas_duplicadas)

Linhas duplicadas:
Empty DataFrame
Columns: [store_id, manager_staff_id, address_id, last_update]
Index: []

In [265]:
# Verificando se há valores nulos (NaN) ou em branco em cada coluna
valores_nulos = store.isnull().sum()
print("Quantidade de valores nulos (NaN) ou em branco em cada coluna:")
print(valores_nulos)

Quantidade de valores nulos (NaN) ou em branco em cada coluna:
store_id            0
manager_staff_id    0
address_id          0
last_update         0
dtype: int64

In [266]:
store.head()

   store_id  manager_staff_id  address_id              last_update
0         1                 1           1  2006-02-15 09:57:12.000
1         2                 2           2  2006-02-15 09:57:12.000

In [267]:
# Visualizando o tipo das colunas
print(store.dtypes)

store_id             int64
manager_staff_id     int64
address_id           int64
last_update         object
dtype: object

In [268]:
# Alteração das colunas para DateTime:
store['last_update'] = pd.to_datetime(store['last_update'])

In [269]:
# Visualizando o tipo das colunas, após alterações
print(store.dtypes)

store_id                     int64
manager_staff_id             int64
address_id                   int64
last_update         datetime64[ns]
dtype: object

# Salvando os arquivos tratados em csv

In [270]:
# Definindo o caminho e nome do arquivo CSV para cada DataFrame
caminho_actor = 'C:/Users/aurel/OneDrive/Área de Trabalho/DESAFIO-DISCORAMA/DESAFIO_DISCORAMA/2_tratamento/actor.csv'
caminho_address = 'C:/Users/aurel/OneDrive/Área de Trabalho/DESAFIO-DISCORAMA/DESAFIO_DISCORAMA/2_tratamento/address.csv'
caminho_category = 'C:/Users/aurel/OneDrive/Área de Trabalho/DESAFIO-DISCORAMA/DESAFIO_DISCORAMA/2_tratamento/category.csv'
caminho_city = 'C:/Users/aurel/OneDrive/Área de Trabalho/DESAFIO-DISCORAMA/DESAFIO_DISCORAMA/2_tratamento/city.csv'
caminho_country = 'C:/Users/aurel/OneDrive/Área de Trabalho/DESAFIO-DISCORAMA/DESAFIO_DISCORAMA/2_tratamento/country.csv'
caminho_customer = 'C:/Users/aurel/OneDrive/Área de Trabalho/DESAFIO-DISCORAMA/DESAFIO_DISCORAMA/2_tratamento/customer.csv'
caminho_film = 'C:/Users/aurel/OneDrive/Área de Trabalho/DESAFIO-DISCORAMA/DESAFIO_DISCORAMA/2_tratamento/film.csv'
caminho_film_actor = 'C:/Users/aurel/OneDrive/Área de Trabalho/DESAFIO-DISCORAMA/DESAFIO_DISCORAMA/2_tratamento/film_actor.csv'
caminho_film_category = 'C:/Users/aurel/OneDrive/Área de Trabalho/DESAFIO-DISCORAMA/DESAFIO_DISCORAMA/2_tratamento/film_category.csv'
caminho_inventory = 'C:/Users/aurel/OneDrive/Área de Trabalho/DESAFIO-DISCORAMA/DESAFIO_DISCORAMA/2_tratamento/inventory.csv'
caminho_payment = 'C:/Users/aurel/OneDrive/Área de Trabalho/DESAFIO-DISCORAMA/DESAFIO_DISCORAMA/2_tratamento/payment.csv'
caminho_rental = 'C:/Users/aurel/OneDrive/Área de Trabalho/DESAFIO-DISCORAMA/DESAFIO_DISCORAMA/2_tratamento/rental.csv'
caminho_staff = 'C:/Users/aurel/OneDrive/Área de Trabalho/DESAFIO-DISCORAMA/DESAFIO_DISCORAMA/2_tratamento/staff.csv'
caminho_store = 'C:/Users/aurel/OneDrive/Área de Trabalho/DESAFIO-DISCORAMA/DESAFIO_DISCORAMA/2_tratamento/store.csv'

In [271]:
# Salvando cada DataFrame em um arquivo CSV
actor.to_csv(caminho_actor, index=False)
address.to_csv(caminho_address, index=False)
category.to_csv(caminho_category, index=False)
city.to_csv(caminho_city, index=False)
country.to_csv(caminho_country, index=False)
customer.to_csv(caminho_customer, index=False)
film.to_csv(caminho_film, index=False)
film_actor.to_csv(caminho_film_actor, index=False)
film_category.to_csv(caminho_film_category, index=False)
inventory.to_csv(caminho_inventory, index=False)
payment.to_csv(caminho_payment, index=False)
rental.to_csv(caminho_rental, index=False)
staff.to_csv(caminho_staff, index=False)
store.to_csv(caminho_store, index=False)